

const quizData = [
    {
        question: "1:36 عندما تكون في حفلة , أو في نشاط اجتماعي أنت",
        a: "تتفاعل مع الكثير من الناس، من ضمنهم الغرباء.",
        b: "تتفاعل مع قلة من الناس، معظمهم ممن تعرفهم مسبقاً.",
        correct: "d",
    },
    {
        question: "2:36 عندما تكون في حفلة , أو في نشاط اجتماعي أنت",
        a: "تنصرف مبكراً، وتشعر بأن منهك من التعب والضجر",
        b: "تبقى حتى ساعة متأخرة، وحتى عند إنصرافك تشعر بالطاقة لا تزال في جسدك.",

        correct: "b",
    },
    // {
    //     question: "3:36 أيهما أسهل عليك:",
    //     a: "التعايش مع الواقع.",
    //     b: "التخيل وتوقع ما سيحدث في المستقبل.",
  
    //     correct: "a",
    // },
    // {
    //     question: "4:36 عندما تواجه مشكلة ويتوجب عليك إتخاذ قرار، ما يؤثر فيك أكثر",
    //     a: "الإقناع، من خلال الحقائق والبراهين.",
    //     b: "المشاعر، من النظر في حال الأطراف ذات العلاقة.",

    //     correct: "b",
    // },
    // {
    //     question: "5:36 عندما تعمل على شيء هل تفضل أن يكون العمل",
    //     a: "له موعد تسليم محدد ",
    //     b: "له موعد تسليم مفتوح",

    //     correct: "b",
    // },
    // {
    //     question: "6:36 عندما تقوم بالإختيار",
    //     a: "غالباً ما تقوم بتفحص الخيارات بدقة قبل أن تختار.",
    //     b: "تميل لأن تكون متهوراً في الغالب.",

    //     correct: "b",
    // },
    // {
    //     question: "7:36 هل تميل للأشخاص ",
    //     a: "صاحبي الخيال الواسع.",
    //     b: "الواقعيين.",

    //     correct: "b",
    // },
    // {
    //     question: "8:36 في حياتك وفي عملك: ",
    //     a: "تفضل القيام بالأعمال الروتينية، التي سبق لك تجربتها ونتائجها واضحة لديك.",
    //     b: "تفضل القيام بالأعمال الجديدة، والتي لم تجربها ولا تدري عن نتائج قيامك بها.",

    //     correct: "b",
    // },



    // {
    //     question: "9:36 لو توجب عليك الإختيار بين المديرين التاليين، أيهما تفضل ",
    //     a: "مدير أخلاقه سيئة وتعامله جاف، ولكنه مستوعب للعمل وبإمكانك تعلم الكثير منه.",
    //     b: "مدير غير مستوعب للعمل، مما يوجب عليك الإعتماد على نفسك للتعلم. ولكنه ذو أخلاق عالية، ويعاملك كإبن له.",

    //     correct: "b",
    // },

    // {
    //     question: "10:36 لو كان لديك الخيار بين الفريقين التاليين، أيهما تفضل أن تكون عضواً فيه ",
    //     a: "فريق عمل جميع أعضاءه على اتفاق ويعملون بتناغم.",
    //     b: "فريق عمل النقاشات فيه حادة وتبادل الأفكار فيه كثير.",

    //     correct: "b",
    // },

    // {
    //     question: "11:36 عندما تعمل هل تفضل:",
    //     a: "العمل وحيداً.",
    //     b: "العمل ضمن فريق أو مع شخص آخر.",

    //     correct: "b",
    // },

    // {
    //     question: "12:36 في الغالب طريقة عملك: ",
    //     a: "مرنة بحيث تسترخي في فترات، ثم تضغط نفسك قبل موعد التسليم.",
    //     b: "مرتبة ومنظمة، بحيث تحاول الموازنة بين العمل والإسترخاء، وبالتالي تنهي الأعمال قبل موعدها.",

    //     correct: "b",
    // },
    // {
    //     question: "13:36 عندما تجد نفسك أمام عمل أو مهمة مملة ",
    //     a: "تلتزم بجدول عملك وتلزم نفسك بالإنتهاء من الجزء المطلوب منك.",
    //     b: "تحاول تأجيل العمل قدر المستطاع، حتى لا يصبح ذلك خياراً لديك",

    //     correct: "b",
    // },
    // {
    //     question: "14:36 هل تشعر بأنك تستوعب أكثر من خلال:",
    //     a: "الإستماع لشروحات ونقاش الآخرين",
    //     b: "مشاركة الآخرين، واستعراض ما فهمته من الفكرة لهم.",

    //     correct: "b",
    // },
    // {
    //     question: "15:36 عندما يكون لديك الخيار بين مهمتين لتنجزهما، انت",
    //     a: "تبدأ بالمهمة التي يتوجب عليك إنهاءها أولاً.",
    //     b: "تبدأ بالمهمة التي تحبها وتستمتع بأداءها أولاً",

    //     correct: "b",
    // },
    // {
    //     question: "16:36  عندما يتوجه إليك أحدهم بسؤال:",
    //     a: "تجاوبه فوراً وفق المعلومات التي تعرفها.",
    //     b: "تطلب منه الإنتظار لحين بحثك وتأكدك مما تعرفه عن الموضوع قبل إجابته.",

    //     correct: "b",
    // },
    // {
    //     question: "17:36  أنت تفضل:",
    //     a: "العمل على مهمة واحدة، والإنتهاء منها قبل الإنتقال لمهمة جديدة.",
    //     b: "العمل على عدة مهام وواجبات في نفس الوقت.",

    //     correct: "b",
    // },


    // {
    //     question: "18:36  عندما تتناقش مع شخص آخر:",
    //     a: "ي العادة تكون متسرعاً، وتطرح العديد من الأفكار حتى وإن لم تكن متأكداً من صحتها.",
    //     b: "في العادة لا تتسرع بطرح أفكارك حتى تفكر فيها بشكل جيد.",

    //     correct: "b",
    // },


    // {
    //     question: "19:36  في عملك، وحياتك عموماً:",
    //     a: "تتضايق بشدة عند مواجهتك مع حقيقة تشذ عن القوانين التي تعلمتها أو درستها.",
    //     b: "لا تضايقك الحقائق الشاذة، بل ترى فيها فرصة للبحث والدراسة حولها لتتعلم عنها.",

    //     correct: "b",
    // },

    // {
    //     question: "20:36  عندما يتم إسناد مهمة لك:",
    //     a: "تفضل أن يتم شرح الخطوات والأمور المطلوب منك إنجازها.",
    //     b: "تفضل أن تعطى الهدف من المهمة، وأن تترك طريقة التنفيذ لمخيلتك.",

    //     correct: "b",
    // },


    // {
    //     question: "21:36  في الغالب أسعى لأن أكون:",
    //     a: "الأفضل في كل شيء.",
    //     b: "النجاح بشكل عام، والتميز في بعض الأمور فقط.",

    //     correct: "b",
    // },


    // {
    //     question: "22:36  عندما تسند إليك مهمة:",
    //     a: "تفكر في المطلوب منك، وتحلله قبل أن تباشر العمل عليه.",
    //     b: "تباشر العمل عليها، وتفكر بالنتائج لاحقاً.",

    //     correct: "b",
    // },

    // {
    //     question: "23:36  عندما تعمل لوحدك:",
    //     a: "تحتاج للكثير من أوقات الراحة، والتي غالباً ما تقضيها بالتحدث مع شخص آخر.",
    //     b: "لا تحتاج للكثير من أوقات الراحة، وحتى إن حصل، فأنت تفضل أن تكون لحظات هدوء واسترخاء.",

    //     correct: "b",
    // },

    // {
    //     question: "24:36  عندما يرتكب زميل لك خطأ فإن أفضل طريقة لتصحيح خطأه:",
    //     a: "الصراحة والمباشرة، حتى وإن تسبب ذلك في جرح مشاعره.",
    //     b: "محاولة تفهم موقفه والتعرف على الأسباب الداعية لما صنع.",

    //     correct: "b",
    // },
    // {
    //     question: "25:36 عند النقاش أو التفاوض، أنت تشعر بالراحة أكثر: ",
    //     a: "أثناء استعراض الحقائق، والتعرف على التفاصيل ذات العلاقة.",
    //     b: "لحظة الوصول إلى إتفاق، أو إنتهاء النقاش.",

    //     correct: "b",
    // },
    // {
    //     question: "26:36 يعجبك في نفسك: ",
    //     a: "طيبة قلبك، وتفهمك للآخرين وإهتمامك بهم.",
    //     b: "معرفتك، وقوة رأيك الذي لا يتزعزع.",

    //     correct: "b",
    // },
    // {
    //     question: "27:36 هل تفضل:",
    //     a: "تعلم مهارات قليلة وإتقانها بشكل جيد.",
    //     b: "تعلم أشياء عديدة، وإتقان ما يتوجب عليك إتقانه حين تحتاج إليه.",

    //     correct: "b",
    // },
    // {
    //     question: "28:36 أنت تتعلم بشكل أفضل عندما:",
    //     a: " تتخيل، وتحاول تخمين ما الذي سيحصل عندما تتغير المعطيات.",
    //     b: "عندما تجرب الشيء، وترى تغير النتائج بين يديك.",

    //     correct: "b",
    // },
    // {
    //     question: "29:36 عندما يتم سؤالك عن شيء، هل أنت في الغالب:",
    //     a: " تقوم بمحاولة إقناع الطرف الآخر بنظرتك حيال الشيء، من خلال اتباع اسلوب الإثبات والعرض لما تعرفه.",
    //     b: "تقوم بدعوة الطرف الآخر للتعرف على نظرتك حيال الشيء، وذلك من خلال وصف وشرح ما تعرفه عنه.",

    //     correct: "b",
    // },
    // {
    //     question: "30:36  رضا نفسك ينبع من:",
    //     a: " معرفتك بما يتوقع الناس منك إنجازه، ومحاولة بلوغه.",
    //     b: "معرفتك بطموحاتك وأهدافك الخاصة، ومحاولة بلوغها.",

    //     correct: "b",
    // },
    // {
    //     question: "31:36  ايهما أسوء بنظرك:",
    //     a: " الظلم",
    //     b: "القسوة",

    //     correct: "b",
    // },


    // {
    //     question: "32:36 عندما تعمل على عمل روتيني، هل تفضل:",
    //     a: " إنجازه بالطريقة التقليدية",
    //     b: "إنجازه بطريقتك الخاصة",

    //     correct: "b",
    // },

    // {
    //     question: "33:36  أيهما يجذبك، وتفضل العمل فيه:",
    //     a: "التصميم والبحث والتخطيط.التصميم والبحث والتخطيط.",
    //     b: "الإنتاج والتنفيذ والتوزيع.",

    //     correct: "b",
    // },

    // {
    //     question: "34:36 هل تشعر بأنك في الغالب: ",
    //     a: "عفوي أكثر من كونك متأن أو متروي",
    //     b: "متأن أو متروي أكثر من كونك عفوي",

    //     correct: "b",
    // },
    // {
    //     question: "35:36  أيهما تفضل:",
    //     a: "الترتيب والتخطيط للأشياء قبل حدوثها.",
    //     b: "ترك الأشياء تحدث ومن ثم التعامل معها.",

    //     correct: "b",
    // },
    // {
    //     question: "36:36  عندما ترغب بإتخاذ قرار، تشعر بالراحة عندما يكون عليك التعامل مع:",
    //     a: "الأنظمة والقوانين.",
    //     b: "العواطف والمشاعر.",

    //     correct: "b",
    // },
    
];
    
const quiz= document.getElementById('quiz')
const answerEls = document.querySelectorAll('.answer')
const questionEl = document.getElementById('question')
const a_text = document.getElementById('a_text')
const b_text = document.getElementById('b_text')

const submitBtn = document.getElementById('submit')
let currentQuiz = 0
let score = 0
loadQuiz()
function loadQuiz() {
    deselectAnswers()
    const currentQuizData = quizData[currentQuiz]
    questionEl.innerText = currentQuizData.question
    a_text.innerText = currentQuizData.a
    b_text.innerText = currentQuizData.b

}
function deselectAnswers() {
    answerEls.forEach(answerEl => answerEl.checked = false)
}
function getSelected() {
    let answer
    answerEls.forEach(answerEl => {
        if(answerEl.checked) {
            answer = answerEl.id
        }
    })
    return answer
}
submitBtn.addEventListener('click', () => {
    const answer = getSelected()
    if(answer) {
       if(answer === quizData[currentQuiz].correct) {
           score++
       }
       currentQuiz++
       if(currentQuiz < quizData.length) {
           loadQuiz()
       } else {
           quiz.innerText = window.location.replace('self_type.html');


    }

    }
})


